score.el
((version 10)
 ("title")
 ("content")
 ("title-or-content"
  ;; High score
  (:text "advisory" :title-value 2000 :content-value 2000 :type w)
  (:text "judas release" :title-value 2000 :content-value 2000 :type w)
  (:text "bioshock release" :title-value 2000 :content-value 2000 :type w)
  (:text "judas" :title-value 1000 :content-value 1000 :type w)
  (:text "ghost story" :title-value 1000 :content-value 1000 :type w)
  (:text "fallout" :title-value 500 :content-value 500 :type w)
  (:text "call of duty" :title-value 500 :content-value 500 :type w)
  (:text "doom" :title-value 500 :content-value 500 :type w)
  (:text "elder scrolls" :title-value 500 :content-value 500 :type w)
  (:text "media molecule" :title-value 500 :content-value 500 :type w)
  (:text "magit release" :title-value 400 :content-value 400 :type w)

  ;; MID SCORE
  (:text "halifax election" :title-value 400 :content-value 400 :type w)
  (:text "starship" :title-value 400 :content-value 400 :type w)
  (:text "mars" :title-value 400 :content-value 400 :type w)
  (:text "nova scotia election" :title-value 400 :content-value 400 :type w)
  (:text "education" :title-value 300 :content-value 300 :type w)
  (:text "housing" :title-value 200 :content-value 200 :type w)
  (:text "healthcare" :title-value 200 :content-value 200 :type w)
  (:text "climate change" :title-value 100 :content-value 100 :type w)
  (:text "emissions targets" :title-value 50 :content-value 50 :type w)
  (:text "child care" :title-value 100 :content-value 100 :type w)

  ;; LOW SCORE
  (:text "halifax" :title-value 99 :content-value 99 :type s)
  (:text "nova scotia" :title-value 99 :content-value 99 :type s)
  (:text "bioshock" :title-value 99 :content-value 99 :type s)
  (:text "javascript" :title-value 99 :content-value 99 :type s)

  ;; Bonus Points
  (:text "positive" :title-value 50 :content-value 50 :type w)
  (:text "motivational" :title-value 50 :content-value 50 :type w)
  (:text "inspiring" :title-value 50 :content-value 50 :type w)
  (:text "hopeful" :title-value 50 :content-value 50 :type w)
  (:text "purpose" :title-value 50 :content-value 50 :type w)
  (:text "resilient" :title-value 50 :content-value 50 :type w)
  (:text "interoperability" :title-value 50 :content-value 50 :type w)
  (:text "zero-Knowledge proofs" :title-value 50 :content-value 50  :type w)
  (:text "decentralized identity" :title-value 50 :content-value 50  :type w)
  (:text "decentralized identity" :title-value 50 :content-value 50  :type w)
  (:text "decentralized governance" :title-value 50 :content-value 50  :type w)
  (:text "artificial general inteligence" :title-value 50 :content-value 50  :type w)
  (:text "milestones" :title-value 50 :content-value 50  :type w)
  (:text "AI tool" :title-value 50 :content-value 50  :type w)

  ;; Stuff I don't need to hear about
  (:text "woke culture" :title-value -5000 :content-value -5000  :type w)
  (:text "cancel culture" :title-value -5000 :content-value -5000  :type w)
  (:text "virtue signaling" :title-value -5000 :content-value -5000  :type w)
  (:text "culture wars" :title-value -5000 :content-value -5000 :type w)
  (:text "tokenism" :title-value -5000 :content-value -5000 :type w)
  (:text "trans" :title-value -5000 :content-value -5000 :type w)
  )
 ("tag")
 ("authors"
  (:text "Ken Levine" :value 2000 :type s))
 ("feed"
  (:text "Nova Scotia News" :value 2 :type w :attr t)
  )
 ("adjust-tags"))
